tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "supabase/tap"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Modern, maintained replacement for ls
brew "eza"
# Fast and simple Node.js version manager
brew "fnm"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node"
# Fast, disk space efficient package manager
brew "pnpm"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Autoformat shell script source code
brew "shfmt"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Supabase CLI
brew "supabase/tap/supabase"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# AI-powered productivity tool for the command-line
cask "amazon-q"
cask "font-fira-code-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Replacement for Docker Desktop
cask "orbstack"
# Control your tools with a few keystrokes
cask "raycast"
# Open-source code editor
cask "visual-studio-code"
# JavaScript IDE
cask "webstorm"
# Multiplayer code editor
cask "zed"
vscode "amazonwebservices.codewhisperer-for-command-line-companion"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "foxundermoon.shell-format"
vscode "mikestead.dotenv"
vscode "sumneko.lua"
vscode "tamasfe.even-better-toml"
vscode "timonwong.shellcheck"
vscode "vscodevim.vim"
vscode "wayou.vscode-todo-highlight"
